lobonz/openmelt2-ESP32/openmelt/motor_driver.cpp
//this module handles interfacing to the motors

#include "arduino.h"
#include "melty_config.h"
#include "motor_driver.h"
#include "debug_handler.h"
#include <ESP32Servo.h>  // Using ESP32-specific servo library

// Servo objects for ESC control when using SERVO_PWM_THROTTLE
Servo motor1_servo;
Servo motor2_servo;

// Variables to store current PWM values
int current_motor1_pulse_width = 1500;
int current_motor2_pulse_width = 1500;

// Flag to enable direct ESC control (bypasses translational drift)
bool direct_esc_control = false;

// Getter functions for current PWM values
int get_motor1_pulse_width() {
  return current_motor1_pulse_width;
}

int get_motor2_pulse_width() {
  return current_motor2_pulse_width;
}

// Function to enable/disable direct ESC control
void set_direct_esc_control(bool enable) {
  direct_esc_control = enable;
  if (enable) {
    debug_print_level(DEBUG_WARNING, "MOTOR", "DIRECT ESC CONTROL ENABLED");
    debug_print("MOTOR", "Bypassing translational drift for direct throttle testing");
  } else {
    debug_print("MOTOR", "DIRECT ESC CONTROL DISABLED");
    debug_print("MOTOR", "Returning to normal translational drift control");
  }
}

// Function to directly set ESC throttle for testing
// throttle_percent should be 0.0-1.0
void set_esc_throttle(float throttle_percent) {
  if (!direct_esc_control) return;
  
  if (THROTTLE_TYPE == SERVO_PWM_THROTTLE) {
    // Map throttle_percent (0-1.0) to pulse width (1500-2000μs)
    int pulse_width = 1500;
    if (throttle_percent > 0) {
      pulse_width = 1500 + (throttle_percent * 500);
    }
    
    // Set both ESCs to the same throttle
    current_motor1_pulse_width = pulse_width;
    current_motor2_pulse_width = pulse_width;
    motor1_servo.writeMicroseconds(pulse_width);
    motor2_servo.writeMicroseconds(pulse_width);
    
    debug_printf("MOTOR", "Direct ESC Control - Throttle: %.1f%%, PWM: %d", throttle_percent * 100, pulse_width);
  }
}

// Function to update PWM values for diagnostics
void update_pwm_values(int motor1_pwm, int motor2_pwm) {
  current_motor1_pulse_width = motor1_pwm;
  current_motor2_pulse_width = motor2_pwm;
}

// Function to directly set servo PWM values
void set_servo_pwm(int motor_pin, int pulse_width) {
  if (motor_pin == MOTOR_PIN1) {
    current_motor1_pulse_width = pulse_width;
    motor1_servo.writeMicroseconds(pulse_width);
  } else if (motor_pin == MOTOR_PIN2) {
    current_motor2_pulse_width = pulse_width;
    motor2_servo.writeMicroseconds(pulse_width);
  }
}

// Function to arm or calibrate ESCs
// For normal operation, just call init_motors()
// For calibration, call this function with calibrate=true
void arm_calibrate_escs(bool calibrate) {
  if (THROTTLE_TYPE != SERVO_PWM_THROTTLE) return;
  
  // Attach servos to pins
  motor1_servo.attach(MOTOR_PIN1);
  motor2_servo.attach(MOTOR_PIN2);
  
  if (calibrate) {
    // ESC Calibration sequence
    // 1. Send max signal (this usually enters programming mode)
    debug_print("MOTOR", "Calibration: Set throttle to maximum");
    motor1_servo.writeMicroseconds(2000);
    motor2_servo.writeMicroseconds(2000);
    current_motor1_pulse_width = 2000;
    current_motor2_pulse_width = 2000;
    delay(5000);
    
    // 2. Send neutral signal
    debug_print("MOTOR", "Calibration: Set throttle to neutral");
    motor1_servo.writeMicroseconds(1500);
    motor2_servo.writeMicroseconds(1500);
    current_motor1_pulse_width = 1500;
    current_motor2_pulse_width = 1500;
    delay(5000);
    
    debug_print("MOTOR", "Calibration complete - ESCs should now be calibrated");
  } else {
    // Normal arming sequence
    // Start with neutral signal
    motor1_servo.writeMicroseconds(1500);
    motor2_servo.writeMicroseconds(1500);
    current_motor1_pulse_width = 1500;
    current_motor2_pulse_width = 1500;
    delay(1000);  // Give ESCs time to initialize
  }
}

//motor_X_on functions are used for the powered phase of each rotation
//motor_X_coast functions are used for the unpowered phase of each rotation
//motor_X_off functions are used for when the robot is spun-down

void motor_on(float throttle_percent, int motor_pin) {

  // Debug output every 500ms
  static unsigned long last_debug = 0;
  if (millis() - last_debug > 500) {
    debug_printf("MOTOR", "Motor_on called - Throttle percent: %.2f%%, Motor pin: %d", throttle_percent * 100, motor_pin);
    last_debug = millis();
  }

  if (THROTTLE_TYPE == BINARY_THROTTLE) {
    digitalWrite(motor_pin, HIGH);
  }

  if (THROTTLE_TYPE == FIXED_PWM_THROTTLE) {
    analogWrite(motor_pin, PWM_MOTOR_ON);
  }

//If DYNAMIC_PWM_THROTTLE - PWM is scaled between PWM_MOTOR_COAST and PWM_MOTOR_ON
//Applies over range defined by DYNAMIC_PWM_THROTTLE_PERCENT_MAX - maxed at PWM_MOTOR_ON above this
  if (THROTTLE_TYPE == DYNAMIC_PWM_THROTTLE) {
    float throttle_pwm = PWM_MOTOR_COAST + ((throttle_percent / DYNAMIC_PWM_THROTTLE_PERCENT_MAX) * (PWM_MOTOR_ON - PWM_MOTOR_COAST));
    if (throttle_pwm > PWM_MOTOR_ON) throttle_pwm = PWM_MOTOR_ON;
    analogWrite(motor_pin, throttle_pwm);
  }
  
  if (THROTTLE_TYPE == SERVO_PWM_THROTTLE) {
    // For standard RC servo PWM with bi-directional ESCs
    int pulse_width = 1500;
    
    // Only proceed if throttle is actually above 0
    if (throttle_percent > 0) {
      // Use SERVO_PWM_TRANSLATE_PERCENT to determine the on-phase pulse width
      // This sets the powered portion to a fixed percentage of maximum throttle
      pulse_width = 1500 + (SERVO_PWM_TRANSLATE_PERCENT * 500);
      
      // Limit user throttle input to control duty cycle / portion of rotation
      // that motors are on, but not the actual power level during on phase
    }
    
    // Debug pulse width calculation
    if (millis() - last_debug > 500) {
      debug_printf("MOTOR", "Input throttle: %.2f%%, Translate percent: %.2f%%, Output PWM: %d μs", 
                  throttle_percent * 100, SERVO_PWM_TRANSLATE_PERCENT * 100, pulse_width);
    }
    
    if (motor_pin == MOTOR_PIN1) {
      current_motor1_pulse_width = pulse_width;
      motor1_servo.writeMicroseconds(pulse_width);
    } else if (motor_pin == MOTOR_PIN2) {
      current_motor2_pulse_width = pulse_width;
      motor2_servo.writeMicroseconds(pulse_width);
    }
  }
}

void motor_1_on(float throttle_percent) {
  motor_on(throttle_percent, MOTOR_PIN1);
}

void motor_2_on(float throttle_percent) {
  motor_on(throttle_percent, MOTOR_PIN2);
}

void motor_coast(int motor_pin) {
  if (THROTTLE_TYPE == FIXED_PWM_THROTTLE || THROTTLE_TYPE == DYNAMIC_PWM_THROTTLE) {
    analogWrite(motor_pin, PWM_MOTOR_COAST);
  }
  if (THROTTLE_TYPE == BINARY_THROTTLE) {
    digitalWrite(motor_pin, LOW);  //same as "off" for brushed motors
  }
  if (THROTTLE_TYPE == SERVO_PWM_THROTTLE) {
    // For bi-directional ESCs, handle coast mode based on SET_SERVO_PWM_COAST_PERCENT
    if (motor_pin == MOTOR_PIN1) {
      if (SET_SERVO_PWM_COAST_PERCENT <= 0.0f) {
        // Use neutral (1500μs) if coast percent is zero
        current_motor1_pulse_width = 1500;
        motor1_servo.writeMicroseconds(1500);
      } else {
        // Calculate pulse width as a percentage of the current throttle
        int pulse_width = 1500;
        int throttle_range = current_motor1_pulse_width - 1500;
        pulse_width = 1500 + (throttle_range * SET_SERVO_PWM_COAST_PERCENT);
        current_motor1_pulse_width = pulse_width;
        motor1_servo.writeMicroseconds(pulse_width);
      }
    } else if (motor_pin == MOTOR_PIN2) {
      if (SET_SERVO_PWM_COAST_PERCENT <= 0.0f) {
        // Use neutral (1500μs) if coast percent is zero
        current_motor2_pulse_width = 1500;
        motor2_servo.writeMicroseconds(1500);
      } else {
        // Calculate pulse width as a percentage of the current throttle
        int pulse_width = 1500;
        int throttle_range = current_motor2_pulse_width - 1500;
        pulse_width = 1500 + (throttle_range * SET_SERVO_PWM_COAST_PERCENT);
        current_motor2_pulse_width = pulse_width;
        motor2_servo.writeMicroseconds(pulse_width);
      }
    }
  }
}

void motor_1_coast() {
  motor_coast(MOTOR_PIN1);
}

void motor_2_coast() {
  motor_coast(MOTOR_PIN2);
}

void motor_off(int motor_pin) {
  if (THROTTLE_TYPE == FIXED_PWM_THROTTLE || THROTTLE_TYPE == DYNAMIC_PWM_THROTTLE) {
    analogWrite(motor_pin, PWM_MOTOR_OFF);
  }
  if (THROTTLE_TYPE == BINARY_THROTTLE) {
    digitalWrite(motor_pin, LOW);  //same as "off" for brushed motors
  }
  if (THROTTLE_TYPE == SERVO_PWM_THROTTLE) {
    // For bi-directional ESCs, send neutral pulse width (1500μs = 0% throttle)
    if (motor_pin == MOTOR_PIN1) {
      current_motor1_pulse_width = 1500;
      motor1_servo.writeMicroseconds(1500);
    } else if (motor_pin == MOTOR_PIN2) {
      current_motor2_pulse_width = 1500;
      motor2_servo.writeMicroseconds(1500);
    }
  }
}

void motor_1_off() {
  motor_off(MOTOR_PIN1);
}

void motor_2_off() {
  motor_off(MOTOR_PIN2);
}

void motors_off() {
  motor_1_off();
  motor_2_off();
}

void init_motors() {
  if (THROTTLE_TYPE == SERVO_PWM_THROTTLE) {
    // Use the arming function (without calibration)
    arm_calibrate_escs(false);
  } else {
  pinMode(MOTOR_PIN1, OUTPUT);
  pinMode(MOTOR_PIN2, OUTPUT);
  }
  motors_off();
}
